#+title: Todo

Work Todos

* DoseSpot [11/11]
** [X] WE-696: DoseSpot V2 JSON
:LOGBOOK:
CLOCK: [2024-06-03 Mon 09:48]--[2024-06-03 Mon 10:13] =>  0:25
:END:
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-125][WISPENG-125]]: Use 'GetMedicationByNDC' instead of 'GetMedicationByNameAndStrength' for DoseSpot V2
** NO [[https://hellowisp.atlassian.net/browse/WISPENG-260][WISPENG-260]]: Combine "GenericProductName" and "GenericDrugName"
- Note taken on [2024-06-10 Mon 13:20] \\
  Won't do. There is no equivalent for "GenericProductName" in DoseSpot V2.
- Note taken on [2024-06-10 Mon 11:32] \\
  We may not need to do this one, depending on what DoseSpot says.
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4259][WISPENG-266]]: Adds metadata check in dispensable_drug_id property
- Note taken on [2024-06-07 Fri 15:02] \\
  Currently in draft. Publish it on Monday morning and get reviews.
** [X] Prepare for the DoseSpot call on 2024-06-10 by checking the V1 vs V2 changes for generic product name
:LOGBOOK:
CLOCK: [2024-06-10 Mon 11:18]--[2024-06-10 Mon 11:31] =>  0:13
CLOCK: [2024-06-10 Mon 10:46]--[2024-06-10 Mon 11:11] =>  0:25
CLOCK: [2024-06-10 Mon 10:10]--[2024-06-10 Mon 10:35] =>  0:25
:END:
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4265][WISPENG-268]]: When getting a medication by RxCUI in V2, ~DrugName~ is null in service response, but not in API JSON response.
:LOGBOOK:
CLOCK: [2024-06-10 Mon 11:52]--[2024-06-10 Mon 12:17] =>  0:25
:END:
- Note taken on [2024-06-10 Mon 11:35] \\
  Need tests for this. Tests should have failed before when this didn't work.
** [X] [[https://hellowisp.atlassian.net/browse/WISPENG-270][WISPENG-270]]: DoseSpotAPIMedicationV2 should accept 'RXCUI' and 'RxCUI'
** [X] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4270][WISPENG-271]]: Adds guard clause to dosespot_drug_metadata property
** [X] Ask if we can get a provider onboard for the DoseSpot launch
- Note taken on [2024-06-20 Thu 14:05] \\
  Andrea will help us out here
** [X] Write a release plan for DoseSpot V2
*** [X] Rollback plan?
*** [X] Schedule of what's going to happen
*** [X] What's important to us?
*** [X] How do we make sure everything worked?
*** [X] Who is going to be doing tests, quick fixes?
*** [X] Section of metrics that we will be watching
**** [X] Find a dashboard in Datadog for fill requests
*** [X] Post-release plan
*** [X] Document the need to change the feature flag
*** [X] Docuement the need to change the subscription key
** [20/20] Document all possible Patient uses of the DoseSpot API
*** [X] CancelPrescription
*** [X] CopyPrescription
*** [X] CreateCodedFillRequestRx
*** [X] CreateFreeTextFillRequestRx
*** [X] CreateOrUpdatePatient
*** [X] DeletePendingRx
*** [X] GetClinicianAddress
*** [X] GetMedicationByNameAndStrength
*** [X] GetMedicationByNDC
*** [X] GetMedicationByRxcui
- Note taken on [2024-06-20 Thu 14:22] \\
  Check ~assert_dosespot_metadata~ usages.
*** [X] GetMedicationMonograph
*** [X] GetNotificationsCounts
*** [X] GetPatientPrescription
*** [X] GetPatientPrescriptions
*** [X] GetPharmacy
*** [X] GetSsoUrl
*** [X] SearchMedicationsByName
*** [X] SearchPharmacies
*** [X] SendPrescriptions
*** [X] UpdatePrescriptionPharmacy
** [X] Document which services need pagination
*** [X] GetPatientPrescriptions
*** [X] SearchMedicationsByName
*** [X] SearchPharmacies
* Misc [1/2]
** [?] [[https://github.com/hellowisp/secure.hellowisp.com/pull/4260][Unticketed PR]] to change SnoozeRequestMixin.missed_calls_count to be non-nullable
** [X] Remove feature flag for disabling DoseSpot API

** [ ] models.Patient.has_synchronous_state can return None
This method should only ever return True or False
** [ ] models.Patient.has_synchronous_state can cause memory leaks because of lru_cache
* Editable Medications
** [X] WE-460: New Provider UI
** [-] WE-460 Tests
:LOGBOOK:
CLOCK: [2024-08-26 Mon 15:06]
:END:
* Messages to post
** [ ] Ask in dev-private what everyone thinks about the type hint for returning "Self" from Pydantic validators.
We have two options:
- return ~typing_extensions.Self~
- return the same class name in quotes.

It doesn't /really/ matter much, but we should pick one and stick with it.

Note that ~Self~ is part of ~typing~ as of Python 3.11, but for now, we need to use ~typing_extensions~. Only mentioning this in case your IDE suggests importing from ~typing~ (mine did).



* Tests
** [ ] Move tests in tests/api/v3
These tests are misplaced. They should be in tests/app/controllers/api/v3
** [ ] ProductFactory.description should not be None
The DB does not have the column as nullabe, so this should not be ~None~ by default.

create materialized view pending_fill_request_v2 as
SELECT fr.id     AS fill_request_id,
       dr.id     AS provider_id,
       fr.status AS fill_request_status
FROM fill_request fr
         JOIN products pr ON fr.product_id = pr.id
         JOIN pharmacies ph ON fr.pharmacy_id = ph.id
         JOIN patients pa ON fr.patient_id = pa.id
         JOIN addresses ON pa.primary_address_id = addresses.id
         JOIN order2 o ON o.id = fr.order_id
         JOIN providers dr ON dr.is_active
WHERE pr.rx_required
  AND (o.captured OR fr.capture_on_approve)
  AND fr.local_rx_id IS NULL
  AND NOT (fr.status = ANY
           (ARRAY ['canceled'::fill_request_status, 'rejected'::fill_request_status, 'pending_payment'::fill_request_status, 'payment_failed'::fill_request_status]))
  AND NOT (EXISTS (SELECT 1
                   FROM fill_requests_prerequisites frprereq
                            JOIN prerequisites prereqs
                                 ON frprereq.fill_request_id = fr.id AND prereqs.id = frprereq.prerequisite_id
                   WHERE prereqs.status = ANY
                         (ARRAY ['PENDING_SUBMIT'::prerequisite_status, 'PENDING_VERIFICATION'::prerequisite_status])))
  AND (pa.assigned_provider_id IS NULL OR pa.assigned_provider_id = dr.id OR pr.is_lab_test)
  AND fr.created > (now() - '360 days'::interval)
  AND NOT (EXISTS (SELECT 1
                   FROM fill_request_pharmacy_order frpo
                            JOIN pharmacy_order po
                                 ON frpo.fill_request_id = fr.id AND frpo.pharmacy_order_id = po.id AND
                                    po.created > (now() - '360 days'::interval)
                   WHERE po.status = 'delivered'::pharmacy_order_status
                      OR (po.status <> ALL
                          (ARRAY ['admin_fixed_needs_fill'::pharmacy_order_status, 'canceled'::pharmacy_order_status]))))
  AND (EXISTS (SELECT 1
               FROM providers_states ps
                        JOIN states s ON ps.state_id = s.id
               WHERE ps.provider_id = dr.id
                 AND s.abbrev::text = addresses.state::text))
  AND (ph.type = 'local'::pharmacy_type OR NOT (EXISTS (SELECT 1
                                                        FROM rx
                                                        WHERE rx.product_id = fr.product_id
                                                          AND rx.pharmacy_id = fr.pharmacy_id
                                                          AND rx.patient_id = fr.patient_id
                                                          AND NOT rx.admin_expired
                                                          AND now() < (rx.created + '360 days'::interval)
                                                          AND rx.fill_count > ((SELECT count(DISTINCT po.id) AS count
                                                                                FROM pharmacy_order po
                                                                                         JOIN pharmacy_order_rx porx
                                                                                              ON porx.rx_id = rx.id AND porx.pharmacy_order_id = po.id
                                                                                WHERE po.status <> ALL
                                                                                      (ARRAY ['admin_fixed_needs_fill'::pharmacy_order_status, 'canceled'::pharmacy_order_status]))))))
  AND NOT (EXISTS (SELECT 1
                   FROM lab_test lt
                   WHERE lt.fill_request_id = fr.id));

alter materialized view pending_fill_request_v2 owner to postgres;

create unique index ix__pfr_v2_fr_id_provider_id__uniq
    on pending_fill_request_v2 (fill_request_id, provider_id);

create index ix_pending_fill_request_v2_fill_request_id
    on pending_fill_request_v2 (fill_request_id);

create index ix_pending_fill_request_v2_fill_request_status
    on pending_fill_request_v2 (fill_request_status);

create index ix_pending_fill_request_v2_provider_id
    on pending_fill_request_v2 (provider_id);
